(setq rou_registry
      (list
       (list 'rou_1:dia_sher_pos '(-1 -1))
       (list 'setup_lst
             (list (list "rb_1_Ra" "1")
                   (list "rb_1_Rz" "0")
                   (list "pl_1_RaRz" "1"
                         (list "1" "2" "3" "4"))
                   (list "tgl_1_max_val" "1")
                   (list "eb_1_max_val" "10")
                   (list "pl_1_max_val"
                         "3"
                         (list
                          "80"
                          "40"
                          "20"
                          "10"
                          "5"
                          "2,5"
                          "1,25"
                          "0,63"
                          "0,32"
                          "0,16"
                          "0,08"))
                   (list "tgl_1_min_val" "0")         
                   (list "eb_1_min_val" "5")          
                   (list "pl_1_min_val"
                         "4"
                         (list "80"
                               "40"
                               "20"
                               "10"
                               "5"
                               "2,5"
                               "1,25"
                               "0,63"
                               "0,32"
                               "0,16"
                               "0,08")) ;
                   (list "tgl_1_spos_pol" "0")
                   (list "eb_1_spos_pol" "")  
                   (list "pl_1_spos_pol"
                         "0"
                         (list
                          "Шабрить"
                          "Развертывать"
                          "Протягивать"
                          "Шлифовать"
                          "Притереть"
                          "Полировать"
                          "Хонинговать"
                          "Накатать"))
                                        
                   (list "rb_1_osn_ml_sn" "1")        
                   (list "rb_1_osn_ml_nesn" "0")      
                   (list "rb_1_osn_ml_neobr" "0")     
                   (list "rb_1_bez_sk" "1")           
                   (list "rb_1_kr_sk" "0")            
                   (list "rb_1_kv_sk" "0")            
                   (list "tgl_1_po_konturu" "0")      
                   (list "tgl_1_perevern" "0")        
                   (list "tgl_1_napr_miko_ner" "0")
                   (list "pl_1_napr_miko_ner"
                         "0"
                         (list "Параллельное"
                               "Перпендикулярное"
                               "Скрещенное"
                               "Кольчужное"
                               "Концентричное"
                               "Радиальное"
                               "Точечное"))
                   (list "eb_1_masht" "1") 
                   (list "pl_1_masht"
                         "11"
                         ("100:1" "50:1" "40:1" "25:1"
                                  "20:1" "15:1" "10:1" "5:1" "4:1" "2.5:1" "2:1"
                                  "1:1"
                                  "1:2" "1:2.5" "1:4" "1:5" "1:10" "1:15"
                                  "1:20" "1:25" "1:40" "1:50" "1:100")) 
                   (list "error" "")))))

(setq rou_registry
      '((rou_1:dia_sher_pos (-1 -1))
        (setup_lst
         (("rb_1_Ra" "1")                       ;
          ("rb_1_Rz" "0")                       ;
          ("pl_1_RaRz" "1" ("1" "2" "3" "4"))   ;
          ("tgl_1_max_val" "1")         ;tgl_1_11  ; Проставлять текст
          ("eb_1_max_val" "10")         ;eb_1_1 ; Значение
          ("pl_1_max_val" "3" ("80" "40" "20" "10" "5" "2,5" "1,25" "0,63" "0,32" "0,16" "0,08")) ;pl_1_1 ; Значения микронеровностей
          ("tgl_1_min_val" "0")         ;
          ("eb_1_min_val" "5")          ;
          ("pl_1_min_val" "4" ("80" "40" "20" "10" "5" "2,5" "1,25" "0,63" "0,32" "0,16" "0,08")) ;
          ("tgl_1_spos_pol" "0") ;tgl_1_12 ; Проставлять способ получения
          ("eb_1_spos_pol" "")   ;eb_1_2 ; Способ получения
          ("pl_1_spos_pol"
           "0"
           ("Шабрить" "Развертывать" "Протягивать" "Шлифовать" "Притереть" "Полировать" "Хонинговать" "Накатать"))
                                        ;pl_1_2 ; Способ получения шероховатости; "Притереть" "Полировать"
          ("rb_1_osn_ml_sn" "1")        ;rb_1_1 ; Со снятием осн. м-ла
          ("rb_1_osn_ml_nesn" "0")      ;rb_1_2 ; Без снятия осн. м-ла
          ("rb_1_osn_ml_neobr" "0")     ;rb_1_3 ; Необработка
          ("rb_1_bez_sk" "1")           ;rb_1_4 ; Без скобок
          ("rb_1_kr_sk" "0")            ;rb_1_5 ; В () скобках
          ("rb_1_kv_sk" "0")            ;rb_1_6 ; В [] скобках
          ("tgl_1_po_konturu" "0")      ;tgl_1_2 ; По контуру
          ("tgl_1_perevern" "0")        ;tgl_1_3 ; Перевернутый
          ("tgl_1_napr_miko_ner" "0")
          ("pl_1_napr_miko_ner"
           "0"
           ("Параллельное" "Перпендикулярное" "Скрещенное" "Кольчужное" "Концентричное" "Радиальное" "Точечное")) ;ppl_1_1
          ("eb_1_masht" "1")            ;eb_1_3 ; Маштаб
          ("pl_1_masht"
           "11"
           ("100:1" "50:1" "40:1" "25:1"
            "20:1" "15:1" "10:1" "5:1" "4:1" "2.5:1" "2:1"
            "1:1"
            "1:2" "1:2.5" "1:4" "1:5" "1:10" "1:15"
            "1:20" "1:25" "1:40" "1:50" "1:100")) 
          ("error" "")                  ;error ; Поток ошибок
          ))))
